## 1. pandas dataframe

In [1]:
import pand`as as pd

In [2]:
sample = {
    'col1' : [1,2,3,4],
    'col2' : [5,6,7,8],
    'col3' : [9,0,0,0]
}

sample_df = pd.DataFrame(sample)
sample_df

   col1  col2  col3
0     1     5     9
1     2     6     0
2     3     7     0
3     4     8     0

## 2. pandas - db 연결

In [3]:
import sqlite3

con = sqlite3.connect('c:/Users/sw930/code/kiwoom/kospi.db')

In [4]:
# pandas dataframe -> sqlite에 저장
sample_df.to_sql('sample',con)

con.close()

## 3. db -> pandas 가져오기

In [18]:
con = sqlite3.connect('c:/Users/sw930/code/kiwoom/kospi.db')

test_df = pd.read_sql(
    """
    SELECT * FROM sample
    """,
    con,
    index_col='index' # 인덱스 (to_sql은 default로 index 컬럼 추가)
)

In [19]:
test_df

       col1  col2  col3
index
0         1     5     9
1         2     6     0
2         3     7     0
3         4     8     0

In [28]:
kakao_df = pd.read_sql(
    """
    SELECT * FROM kakao
    """,
    con,
    index_col=None # kakao table은 인덱스 컬럼 없음
    #index_col=None ## default이므로 생략도 가능.
)

In [29]:
kakao_df

       Date   Open   High    Low  Closing  Volumn
0  16.06.03  97000  98600  96900    98000  321405
1  16.06.02  99000  99300  96300    97500  556790